//****************** File Icr00A0.h ***********************
//
//  Определения констант и структур 
//	для работы с конфигурационным ППЗУ
//  для субмодулей FM416x125M
//
//*********************************************************

#ifndef _ICR00A0_H
 #define _ICR00A0_H

#pragma pack(push, 1)    

#define ADM_CFG_TAG 0x00A0

// Конфигурационные параметры субмодуля
typedef struct _ICR_Cfg00A0 {
	U16	wTag;		// тэг структуры (ADM_CFG_TAG)
	U16	wSize;		// размер всех следующих полей структуры
	U08	bAdmIfNum;	// номер интерфейса ADM
	U08	bDDC;		// Наличие DDC (0-16)
	U08	bGenType;	// тип кристалла внутр. генератора: 0-не програм-ый, 1-Si571
	U08	bGenAdr;	// адресный код внутр. генератора: 0x49 по умолчанию
	U32	nGenRef;    // заводская установка частоты внутр. генератора (Гц)
	U32	nGenRefMax; // максимальная частота внутр. генератора (Гц)
} ICR_Cfg00A0, *PICR_Cfg00A0, ICR_CfgAdm, *PICR_CfgAdm;

#pragma pack(pop)    

#endif // _ICR00A0_H

// ****************** End of file Icr00A0.h **********************
